exercise-coded-function-object/heatedChannel/Allrun-parallel
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

runApplication blockMesh

restore0Dir

runApplication decomposePar

runParallel $(getApplication)

foamLog log.$(getApplication)
#------------------------------------------------------------------------------
